Tekla.Structures.ModelInternal.PropertySetLibrary
Represents a Property Set Library data class.

Tekla.Structures.ModelInternal.PropertySetLibrary.Id
The PropertySetLibrary library identifier

Tekla.Structures.ModelInternal.PropertySetLibrary.Name
The PropertySetLibrary name

Tekla.Structures.ModelInternal.PropertySetLibrary.Version
The PropertySetLibrary version